const arr = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];


// Знайти суму та кількість позитивних елементів.

  console.log(`Кількість позитивних елементів = ${arr.filter(el => el > 0).length}
  Cума позитивних елементів = ${arr.filter(el => el > 0).reduce((el,acc) => el + acc ,0)}`);

//Знайти мінімальний елемент масиву та його порядковий номер

console.log(`Мінімальний елемент масиву = ${arr.reduce((min, current) => {
  return current < min ? current : min;}, arr[0])}
  Порядковий номер мінімального елементу масиву = ${arr.indexOf(Math.min(...arr))}`);

// Знайти максимальний елемент масиву та його порядковий номер.

console.log(`Максимальний елемент масиву = ${arr.reduce((max, current) => {
  return current > max ? current : max;}, arr[0])}
  Порядковий номер Максимального елементу масиву = ${arr.indexOf(Math.max(...arr))}`);

// Визначити кількість негативних елементів.

console.log(`Кількість негативних елементів = ${arr.filter(el => el < 0).length}`);

// Знайти кількість непарних позитивних елементів.

console.log(`Кількість непарних позитивних елементів = ${arr.filter(el => el > 0).filter(el => el % 2).length}`);

// Знайти кількість парних позитивних елементів.

console.log(`Кількість парних позитивних елементів = ${arr.filter(el => el > 0 && el % 2 === 0).length}`);

// Знайти суму парних позитивних елементів.

console.log(`Cума парних позитивних елементів = ${arr.filter(el => el > 0 && el % 2 === 0).reduce ((acc, el) => acc += el)}`);

// Знайти суму непарних позитивних елементів.

console.log(`Cума парних позитивних елементів = ${arr.filter(el => el > 0 && el % 2 !== 0).reduce ((acc, el) => acc += el)}`);

// Знайти добуток позитивних елементів.

console.log(`Cума парних позитивних елементів = ${arr.filter(el => el > 0).reduce ((acc, el) => acc *= el)}`);

// Знайти найбільший серед елементів масиву, остальні обнулити.

console.log(`Найбільший елемент серед елементів масиву = ${arr.map((item, index) => {
  return item !== Math.max(...arr) ? arr[index] = 0 : arr[index] = item })}`);


